'''
1. Пользователь вводит имя.
    - Отправка данных:
        --- имя
        --- ип, порт
        --- сообщение (1 пусто)
        --- друг (1 пусто)
2.

'''
# -------------------------------------------------------#
# Библиотеки --------------------------------------------#
# -------------------------------------------------------#
import os
import socket
import threading
import time
from random import randint
# -------------------------------------------------------#
# Ключ кодирования---------------------------------------#
# -------------------------------------------------------#
key = 8194
# -------------------------------------------------------#
# Локальные Переменные ----------------------------------#
# -------------------------------------------------------#
shutdown = False
join = False

# -------------------------------------------------------#
# Многопотчность (прием/посылка) ------------------------#
# -------------------------------------------------------#


def receving(name, sock):
    while not shutdown:
        try:
            while True:
                data, addr = sock.recvfrom(1024)
                # print(data.decode("utf-8"))

                # Криптография (кодирование)-------------#
                decrypt = ""
                k = False
                for i in data.decode("utf-8"):
                    if i == ":":
                        k = True
                        decrypt += i
                    elif (i == " ") or (k is not True):
                        decrypt += i
                    else:
                        decrypt += chr(ord(i) ^ key)
                print(decrypt)
                # Конец----------------------------------#

                time.sleep(0.2)  # Прстой программы
        except:
            pass


# -------------------------------------------------------#
# Определение своего ip и хоста -------------------------#
# -------------------------------------------------------#
host = socket.gethostbyname(socket.gethostname())
# host = ('192.168.0.58')
port = randint(3000, 6000)

server = ("192.168.0.56", 2533)

connect = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
connect.bind((host, port))
connect.setblocking(0)
# -------------------------------------------------------#
# Выбор своего имени ------------------------------------#
# -------------------------------------------------------#
nickname = input("Name: ")
# -------------------------------------------------------#
# Запускаем многопоточность -----------------------------#
# -------------------------------------------------------#
rT = threading.Thread(target=receving, args=("RecvThread", connect))
rT.start()
# -------------------------------------------------------#
# Основое тело программы --------------------------------#
# -------------------------------------------------------#
friends_list = []

while shutdown is not True:  # == False:
    if join is not True:  # == False:
        # Подсоединямся к серверу и остаемся онлайн
        connect.sendto((nickname).encode("utf-8"), server)
        join = True  # Переключаем режим
    else:
        # Добавить друга --------------------------------#
        os.system('cls' if os.name == 'nt' else 'clear')  # очистить экран
        menu = input('''
        ---- MENU ----
            1. Быстрые комманды
            2. Написать другу
            3. Выход пользователя из системы
            ''')
        # очистка экрана

        if menu == '1':
            submenu = input('''
            ---- SHORT COMMAND ----
                1. Cписок друзей
                2. Добавить друга
                3. Удалить друга
                4. Заблокировать друга
                ''')
            # -------------------------------------------#
            # Список друзей -----------------------------#
            if submenu == '1':
                connect.sendto(('/list=' + nickname).encode("utf-8"), server)
            # -------------------------------------------#
            # Добавить друга ----------------------------#
            elif submenu == '2':
                other = input('Ввидите имя друга: ')
                connect.sendto(('/add=' +
                                nickname + '=' +
                                other).encode("utf-8"), server)
            # -------------------------------------------#
            # Удалить друга -----------------------------#
            elif submenu == '3':
                other = input('Ввидите имя друга: ')
                connect.sendto(('/del=' +
                                nickname + '=' +
                                other).encode("utf-8"), server)
            # -------------------------------------------#
            # Заблокировать друга -----------------------#
            elif submenu == '4':
                pass

# -------------------------------------------------------#
# Написать другу - --------------------------------------#
# -------------------------------------------------------#
        elif menu == '2':
            other = input('Ввидите имя друга: ')
            txt = input('Ввидите ваше сообщение: ')
            connect.sendto(('t=' +
                            nickname + '=' +
                            other + '=' +
                            txt).encode("utf-8"), server)

# -------------------------------------------------------#
# Выход из системы --------------------------------------#
# -------------------------------------------------------#
        elif menu == '3':
            connect.sendto(('q=' + nickname).encode('utf-8'), server)
            rT.join()
            connect.close()
            quit()

        # Отправить сообщение другу----------------------#
        # Заблокировать пользователя---------------------#
        # Специлальные команды---------------------------#
        # Выход из сервера

        # try:
        #     message = input()

        #     # Begin
        #     crypt = ""
        #     for i in message:
        #         crypt += chr(ord(i) ^ key)
        #     message = crypt
        #     # End

        #     if message != "":
        #         connect.sendto(("[" + nickname + "] :: " +
        #                         message).encode("utf-8"), server)

        #     time.sleep(0.2)
        # except SyntaxError:
        #     connect.sendto(
        #         ("[" + nickname + "] <= left chat ").encode("utf-8"), server)
        #     shutdown = True
# -------------------------------------------------------#
# Библиотеки --------------------------------------------#
# -------------------------------------------------------#

rT.join()
connect.close()
