# ---------------------------------------------------------------------------- #
#                             Fibonacci Sequence
# ---------------------------------------------------------------------------- #

# -------------------------------------2-------------------------------------- #
# a, b = 0, 1
# while b < 2000000:
#     print(b)
#     a, b = b, a+b

# ---------------------------------------------------------------------------- #
#                                 18/02/2019/
# ---------------------------------------------------------------------------- #
n=10
sequence=[0,1]
# Получаем последовательность фибоначи
for i in range(0,n):
    an = sequence[i] + sequence[i + 1]
    sequence.append(an)

# Последовательность фибоначи
print('Последовательность: ',sequence)


# Удаляем одинаковые символы (или просто удаляем index[1] т.е. повторяющуюся 1)
uniqueSequence = list(set(sequence))
print('Уникальный: ', uniqueSequence)

# Сортируем
sortedSequence = sorted(uniqueSequence)
print('Отсортированный: ', sortedSequence)

# Разворачиваем
reversedSequence = sortedSequence[::-1]
print('Развернутый: ', reversedSequence)
# ---------------------------------------------------------------------------- #
#                                 25/01/2021/
# ---------------------------------------------------------------------------- #
