'''

'''
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #
# Основные функции интерфейса:                                          #
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #
# - - - Online:
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #


def __online_acc():  # Войти в сеть
    pass


def __offline_acc():  # Выйти из сети
    pass


def __update_info_acc():  # Обновить инф. о людях, друзьях, сообщениях, лайках
    pass


def __rules():  # Поведение установленные разработчиком
    pass


# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #
# - - - VideoCall:
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #


def __take_stream_talk():  # принимать видео поток
    pass


def __give_stream_talk():  # отправлять видео поток
    pass


def __connect_couple_to_talk():  # Соединить адресата и адресанта
    pass


def __connect_time_of_talk():  # Время общения
    pass


def __desicion_of_opinion_about_talk():  # Что делать после окончания времени
    pass


def __marks_of_talk():  # Что делать после окончания времени
    pass
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #
# - - - Stories:
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #


def __film_stories():  # Заснять короткое видео с телефона
    pass


def __upload_stories():  # Загрузить в пространство
    pass


def __marks_of_stories():  # Оценить историю (Лайк, просмотры и т.д)
    pass

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #
# - - - Filter:
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #


def __filter_options():  # Оценить историю (Лайк, просмотры и т.д)
    pass


def __save_rules_of_filter():  # Оценить историю (Лайк, просмотры и т.д)
    pass

# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - #
